Revit 2027 API
PerformanceAdviser.PostWarning Method
 Reports a problem detected during execution of a rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void PostWarning(
	FailureMessage message
)
Public Sub PostWarning (
	message As FailureMessage
)
public:
void PostWarning(
	FailureMessage^ message
)
member PostWarning :
        message : FailureMessage -> unit
Parameters
message FailureMessage
 Warning describing the problem detected by a rule.
Exceptions
Exception | Condition
ArgumentException |  The message must have severity "warning".
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Performance advisor is not executing rules.
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace